<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#SQL-DATABASES" data-toc-modified-id="SQL-DATABASES-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>SQL DATABASES</a></span><ul class="toc-item"><li><span><a href="#LEARNING-OBJECTIVES:" data-toc-modified-id="LEARNING-OBJECTIVES:-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>LEARNING OBJECTIVES:</a></span></li><li><span><a href="#⨠-Q:-Why-do-we-need-databases?-Why-can't-we-just-use-a-bunch-of-Pandas-DataFrames?" data-toc-modified-id="⨠-Q:-Why-do-we-need-databases?-Why-can't-we-just-use-a-bunch-of-Pandas-DataFrames?-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>⨠ Q: Why do we need databases? Why can't we just use a bunch of Pandas DataFrames?</a></span></li><li><span><a href="#Querying-Databases---SELECTing-data" data-toc-modified-id="Querying-Databases---SELECTing-data-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Querying Databases - <code>SELECT</code>ing data</a></span></li><li><span><a href="#SQL-with-sqlite3" data-toc-modified-id="SQL-with-sqlite3-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>SQL with <code>sqlite3</code></a></span></li><li><span><a href="#FILTERING-AND-ORDERING" data-toc-modified-id="FILTERING-AND-ORDERING-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>FILTERING AND ORDERING</a></span></li><li><span><a href="#GROUPING-DATA-WITH-SQL" data-toc-modified-id="GROUPING-DATA-WITH-SQL-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>GROUPING DATA WITH SQL</a></span></li><li><span><a href="#ALIASING" data-toc-modified-id="ALIASING-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>ALIASING</a></span></li><li><span><a href="#The-WHERE-Clause" data-toc-modified-id="The-WHERE-Clause-1.8"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>The <code>WHERE</code> Clause</a></span></li><li><span><a href="#The-HAVING-clause" data-toc-modified-id="The-HAVING-clause-1.9"><span class="toc-item-num">1.9&nbsp;&nbsp;</span>The <code>HAVING</code> clause</a></span></li><li><span><a href="#Combining-WHERE-and-HAVING" data-toc-modified-id="Combining-WHERE-and-HAVING-1.10"><span class="toc-item-num">1.10&nbsp;&nbsp;</span>Combining <code>WHERE</code> and <code>HAVING</code></a></span></li><li><span><a href="#JOIN-STATEMENTS" data-toc-modified-id="JOIN-STATEMENTS-1.11"><span class="toc-item-num">1.11&nbsp;&nbsp;</span><code>JOIN</code> STATEMENTS</a></span></li><li><span><a href="#The-USING-clause" data-toc-modified-id="The-USING-clause-1.12"><span class="toc-item-num">1.12&nbsp;&nbsp;</span>The <code>USING</code> clause</a></span></li><li><span><a href="#TYPES-OF-JOINS" data-toc-modified-id="TYPES-OF-JOINS-1.13"><span class="toc-item-num">1.13&nbsp;&nbsp;</span>TYPES OF JOINS</a></span></li><li><span><a href="#Primary-vs-Foreign-Keys" data-toc-modified-id="Primary-vs-Foreign-Keys-1.14"><span class="toc-item-num">1.14&nbsp;&nbsp;</span>Primary vs Foreign Keys</a></span></li><li><span><a href="#SQL-Subqueries" data-toc-modified-id="SQL-Subqueries-1.15"><span class="toc-item-num">1.15&nbsp;&nbsp;</span>SQL Subqueries</a></span></li><li><span><a href="#SQL-WITH-PANDAS" data-toc-modified-id="SQL-WITH-PANDAS-1.16"><span class="toc-item-num">1.16&nbsp;&nbsp;</span>SQL WITH PANDAS</a></span></li><li><span><a href="#Using-SQL-with-Pandas" data-toc-modified-id="Using-SQL-with-Pandas-1.17"><span class="toc-item-num">1.17&nbsp;&nbsp;</span>Using SQL with Pandas</a></span></li><li><span><a href="#Using-SQL-syntax-with-pandasql" data-toc-modified-id="Using-SQL-syntax-with-pandasql-1.18"><span class="toc-item-num">1.18&nbsp;&nbsp;</span>Using SQL syntax with <code>pandasql</code></a></span></li><li><span><a href="#SQL-Data-Types" data-toc-modified-id="SQL-Data-Types-1.19"><span class="toc-item-num">1.19&nbsp;&nbsp;</span>SQL Data Types</a></span></li><li><span><a href="#SQL-Data-Types" data-toc-modified-id="SQL-Data-Types-1.20"><span class="toc-item-num">1.20&nbsp;&nbsp;</span>SQL Data Types</a></span></li><li><span><a href="#DATABASE-ADMIN-101" data-toc-modified-id="DATABASE-ADMIN-101-1.21"><span class="toc-item-num">1.21&nbsp;&nbsp;</span>DATABASE ADMIN 101</a></span></li></ul></li></ul></div>

# SQL DATABASES

## LEARNING OBJECTIVES:

- Understand what a database is and how it is different than a DataFrame/Excel sheet.
- Understand how to read database map
    - Primary keys vs forgein keys
- Understand how to select, filter, order, and group data using SQL
- Understand the different types of Joins

SECTION 09: SQL DATABASES


SQL is designed to work with **relational data**. This really just means pieces of data that are **related to eachother**. In the example above, data on the `employees` table has some relationship to data on the `offices` table.

Each table has a **primary key** (like a DataFrame index), with a unique index for each row in the database. The name of the primary key is preceded by an asterix (\*). 

Columns that are the **primary key one on table** can also appear on **other tables**. Then it is refered to as a **foreign key** aka the primary key from a different ("foreign") table.

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-sql-introduction-online-ds-sp-000/master/images/Database-Schema.png">

## ⨠ Q: Why do we need databases? Why can't we just use a bunch of Pandas DataFrames?
-

## Querying Databases - `SELECT`ing data



- NOTE: SQL queries dot not _have_ to be all-caps, but it is a convention to help differentiate sql syntax versus names of tables/columns.

To retrieve data from one or more tables you usually use a `SELECT` statement. 

```
SELECT col1, col2, col3
FROM table
WHERE records match criteria
LIMIT 100;
```

Another similar query to preview all of the columns from the first 5 rows of a table would look like this:  

```SQL
SELECT *
FROM table
LIMIT 5;
```

Notice how all of these statements:
1.  **start with the `SELECT`**
2. followed by **what you want to select**. Separate multiple column names separated by a `,` 
3. Then specify where the data is coming `FROM` followed by the table name. 
4. **Afterward, you can provide conditions such as filters or sorting**. To demonstrate, here's a more complex example where you could preview the 10 most expensive payments received.

```SQL
SELECT *
FROM payments
ORDER BY amount DESC
LIMIT 10;
```

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

## SQL with `sqlite3`

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-sql-introduction-online-ds-sp-000/master/images/Database-Schema.png" width=500>

## FILTERING AND ORDERING

- `ORDER BY` - `DESC`/`ASC`
- `LIMIT`
- `BETWEEN`
- `NULL`
- `COUNT`
- `GROUP BY`

## GROUPING DATA WITH SQL

In [0]:
db = 'datasets/data.sqlite'
import sqlite3
import pandas as pd 
conn = sqlite3.connect(db)
cur = conn.cursor()

- Like we do with Pandas, we can use GROUP BY statements in SQL and then apply **aggregate functions:**
    - `COUNT`
    - `MAX`
    - `MIN`
    - `SUM`
    - `AVG`

In [10]:
cur.execute("""SELECT city, COUNT(employeeNumber)
FROM offices 
JOIN employees
USING(officeCode)
GROUP BY city
ORDER BY count(employeeNumber) DESC;""")

df = pd.DataFrame(cur.fetchall())

df.columns = [x[0] for x in cur.description]

df.head()

            city  COUNT(employeeNumber)
0  San Francisco                      6
1          Paris                      5
2         Sydney                      4
3         Boston                      2
4         London                      2

## ALIASING

- can assign a temporary name to data being imported
- Useful for `JOIN`,`GROUP BY`, and aggregates.

In [11]:
cur.execute("""SELECT city, COUNT(employeeNumber) AS numEmployees
               FROM offices
               JOIN employees
               USING(officeCode)
               GROUP BY 1
               ORDER BY numEmployees DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

            city  numEmployees
0  San Francisco             6
1          Paris             5
2         Sydney             4
3         Boston             2
4         London             2

In [12]:
cur.execute("""SELECT customerName,
               COUNT(customerName) AS number_purchases,
               MIN(amount) AS min_purchase,
               MAX(amount) AS max_purchase,
               AVG(amount) AS avg_purchase,
               SUM(amount) AS total_spent
               FROM customers
               JOIN payments
               USING(customerNumber)
               GROUP BY 1
               ORDER BY SUM(amount) DESC;""")
df = pd.DataFrame(cur.fetchall())
df. columns = [i[0] for i in cur.description]
print(len(df))
df.head()

98

                   customerName  number_purchases  ...  avg_purchase total_spent
0        Euro+ Shopping Channel                13  ...  55056.844615   715738.98
1  Mini Gifts Distributors Ltd.                 9  ...  64909.804444   584188.24
2    Australian Collectors, Co.                 4  ...  45146.267500   180585.07
3            Muscle Machine Inc                 4  ...  44478.487500   177913.95
4       Dragon Souveniers, Ltd.                 4  ...  39062.757500   156251.03

[5 rows x 6 columns]

## The `WHERE` Clause

In general, the `WHERE` clause filters query results by some condition. As you are starting to see, you can also combine multiple conditions.

- 
```python
cur.execute("""SELECT * FROM customers WHERE city = 'Boston' OR city = 'Madrid';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df
```


Two additional keywords that you can use to refine your searches are the `ORDER BY` and `LIMIT` clauses. The order by clause allows you to sort the results by a particular feature. For example, you could sort by the `customerName` column if you wished to get results in alphabetical order. By default, `ORDER BY` is ascending. So, as with the above example, if you want the opposite, use the additional parameter `DESC`. Finally, the limit clause is typically the last argument in a SQL query and simply limits the output to a set number of results.

## The `HAVING` clause

 The `HAVING` clause works similarly to the `WHERE` clause, except it is used to filter data selections on conditions **after** the `GROUP BY` clause.

In [0]:
cur.execute("""SELECT city, COUNT(customerNumber) AS number_customers
               FROM customers
               GROUP BY 1
               HAVING COUNT(customerNumber)>=5;""")
df = pd.DataFrame(cur.fetchall())
df. columns = [i[0] for i in cur.description]
print(len(df))
df.head()

## Combining `WHERE` and `HAVING`

We can also use the `WHERE` and `HAVING` clauses in conjunction with each other for more complex rules.

- For example, let's say we want a list of customers who have made at least 3 purchases of over 50K each.

In [13]:
cur.execute("""SELECT customerName,
               COUNT(amount) AS number_purchases_over_50K
               FROM customers
               JOIN payments
               USING(customerNumber)
               WHERE amount >= 50000
               GROUP BY 1
               HAVING count(amount) >= 3
               ORDER BY count(amount) DESC;""")
df = pd.DataFrame(cur.fetchall())
df. columns = [i[0] for i in cur.description]
print(len(df))
df.head()

53

                   customerName  number_purchases_over_50K
0        Euro+ Shopping Channel                         13
1  Mini Gifts Distributors Ltd.                          9
2       Anna's Decorations, Ltd                          4
3    Australian Collectors, Co.                          4
4            Baane Mini Imports                          4

## `JOIN` STATEMENTS

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-sql-introduction-online-ds-sp-000/master/images/Database-Schema.png">

### Task: Displaying product details along with order details

Let's say you need to generate some report that includes details about products from orders. To do that, we would need to take data from multiple tables in a single statement.

In [0]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('/content/drive/My Drive/Datasets/data.sqlite')
cur = conn.cursor()

In [0]:
cur.execute("""SELECT * 
               FROM orderdetails
               JOIN products
               ON orderdetails.productCode = products.productCode
               LIMIT 10;
               """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

## The `USING` clause

A more concise way to join the tables, if the column name is identical, is the `USING` clause. Rather then saying on `tableA.column = tableB.column` we can simply say `using(column)`. Again, this only works if the column is **identically named** for both tables.

## TYPES OF JOINS

- Joins may be:
    - INNER (default)
    - OUTER
    - LEFT 
    - RIGHT

<img src="https://raw.githubusercontent.com/learn-co-students/dsc-join-statements-online-ds-sp-000/master/images/venn.png">

## Primary vs Foreign Keys
- primary key:
- forgein key:

### One-to-One, One-to-many, many-to-many Joins

## SQL Subqueries

```python
cur.execute("""SELECT lastName, firstName, officeCode
               FROM employees
               WHERE officeCode IN (SELECT officeCode
                                    FROM offices 
                                    WHERE country = "USA");
                                    """)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df
```

## SQL WITH PANDAS

### Using `.query()`

Pandas DataFrames come with a built-in query method, which allows you to get information from DataFrames quickly without using the cumbersome slicing syntax.  

See the following examples:

```python
# Getting Data using slicing syntax
foo_df = bar_df[bar_df[bar_df['Col_1'] > bar_df['Col_2']]]

# Using The query method
foo_df = bar_df.query("Col_1 > Col_2")

# These two lines are equivalent!
```

Note that if you want to use `and` and `or` statements with the `.query()` method, you'll need to use `"&"` and `"|"` instead.

```python
foo_df = bar_df.query("Col_1 > Col_2 & Col_2 <= Col_3")
```

## Using SQL with Pandas

- Pandas DataFrames have a method called `.query()`
- This allows us to use SQL-like commands to reference data.
```python
## Normal Pandas Syntax
foo_df = bar_df.loc[bar_df['Col_1']>bar_df['Col_2']]
```

```python
## Using .query()
foo_df = bar_df.query("Col_1 > Col_2")
```
- How to use:
    - Enter the querty as a single string, using just column names to reference data.
    - To use and/or statements, use `&` and `|`, respectively

```python
foo_df = bar_df.query("Col_1 > Col_2 & Col_2 <= Col_3")
```

## Using SQL syntax with `pandasql`


Since SQL is such a powerful, comfortable tool for Data Scientists, some people had the bright idea of creating a library that lets users query DataFrames using SQL-style syntax.  This library is called [pandasql](https://pypi.org/project/pandasql/).

We can install `pandasql` using the bash command `pip install pandasql`.

### Importing pandasql

In order to use `pandasql`, we need to start by importing a `sqldf` object from `pandasql`

```python
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())
```

### Writing Queries
```python
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""

results = pysqldf(q)

```

## SQL Data Types
- Data types in SQLite3:
    - https://www.sqlite.org/datatype3.html
    
- Data types:
    - TEXT
    - INTEGER
    - REAL
    - BLOB
    - NULL


Since SQL is such a powerful, comfortable tool for Data Scientists, some people had the bright idea of creating a library that lets users query DataFrames using SQL-style syntax.  This library is called [pandasql](https://pypi.org/project/pandasql/).

We can install `pandasql` using the bash command `pip install pandasql`.

#### Importing pandasql

In order to use `pandasql`, we need to start by importing a `sqldf` object from `pandasql`

```python
from pandasql import sqldf
```


Next, it's helpful to write a lambda function that will make it quicker and easier to write queries.  Normally, you would have to pass in the global variables every time we use an object.  In order to avoid doing this every time, here's how to write a lambda that does this for you:

```python
pysqldf = lambda q: sqldf(q, globals())
```

#### Writing Queries

To write a query, you just format it as a multi-line string!

```python
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""
```

In order to query DataFrames, you can just pass in the query string you've created to our `sqldf` object that you stored in `pysqldf`.  This will return a DataFrame.  

```python
results = pysqldf(q)
```



## SQL Data Types
- Data types in SQLite3:
    - https://www.sqlite.org/datatype3.html
    
- Data types:
    - TEXT
    - INTEGER
    - REAL
    - BLOB
    - NULL

## DATABASE ADMIN 101

In [0]:
db = 'datasets/pets_database.db'
import sqlite3
conn = sqlite3.connect(db)
cur = conn.cursor()

In [18]:
cur.execute("""CREATE TABLE cats (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    breed TEXT)
    """)

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 4))

OperationalError: ignored

In [0]:
# insert Maru into the pet_database.db here
cur.execute('''INSERT INTO cats (name, age, breed) 
                  VALUES ('Maru', 3, 'Scottish Fold');
            ''')